In [2]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%config SqlMagic.autocommit=True
%sql mysql://root:simple@127.0.0.1

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# Joins

In [7]:
%%sql
CREATE SCHEMA depend

 * mysql://root:***@127.0.0.1
1 rows affected.

[]

In [8]:
%%sql
use depend

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [11]:
%%sql

CREATE TABLE person (
    person_id int,
    full_name varchar(60),
    PRIMARY KEY (person_id)
);

 * mysql://root:***@127.0.0.1
(pymysql.err.OperationalError) (1050, "Table 'person' already exists")
[SQL: CREATE TABLE person (
    person_id int,
    full_name varchar(60),
    PRIMARY KEY (person_id)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql

CREATE TABLE dependent (
    person_id int,
    provider_id int,
    PRIMARY KEY (person_id),
    FOREIGN KEY (person_id) REFERENCES person(person_id), 
    FOREIGN KEY (provider_id) REFERENCES person(person_id))

 * mysql://root:***@127.0.0.1
0 rows affected.

[]

In [16]:
%%sql

INSERT INTO person (person_id, full_name) VALUES 
    (1, "Bob"),
    (2, "Anne"),
    (3, "Dave"),
    (4, "Carol")

 * mysql://root:***@127.0.0.1
4 rows affected.

[]

In [17]:
%%sql 
INSERT INTO dependent (person_id, provider_id) VALUES 
    (2, 1),
    (3, 1),
    (4, 2),
    (1, 4)

 * mysql://root:***@127.0.0.1
4 rows affected.

[]

In [20]:
%%sql
-- cross join
SELECT * FROM person as p1 JOIN person as p2

 * mysql://root:***@127.0.0.1
16 rows affected.

[(4, 'Carol', 1, 'Bob'),
 (3, 'Dave', 1, 'Bob'),
 (2, 'Anne', 1, 'Bob'),
 (1, 'Bob', 1, 'Bob'),
 (4, 'Carol', 2, 'Anne'),
 (3, 'Dave', 2, 'Anne'),
 (2, 'Anne', 2, 'Anne'),
 (1, 'Bob', 2, 'Anne'),
 (4, 'Carol', 3, 'Dave'),
 (3, 'Dave', 3, 'Dave'),
 (2, 'Anne', 3, 'Dave'),
 (1, 'Bob', 3, 'Dave'),
 (4, 'Carol', 4, 'Carol'),
 (3, 'Dave', 4, 'Carol'),
 (2, 'Anne', 4, 'Carol'),
 (1, 'Bob', 4, 'Carol')]

In [25]:
%%sql
-- inner product: cartesian product restricted by a condition on joining attributes
SELECT * FROM person join dependent ON person.person_id = dependent.person_id

 * mysql://root:***@127.0.0.1
6 rows affected.

[(2, 'Anne', 1, 4),
 (3, 'Dave', 1, 4),
 (3, 'Dave', 2, 1),
 (4, 'Carol', 1, 4),
 (4, 'Carol', 2, 1),
 (4, 'Carol', 3, 1)]

In [28]:
%%sql
-- equijoin on a common attribute
SELECT * FROM person JOIN dependent USING (person_id)

 * mysql://root:***@127.0.0.1
4 rows affected.

[(1, 'Bob', 4), (2, 'Anne', 1), (3, 'Dave', 1), (4, 'Carol', 2)]

In [34]:
%%sql
-- equijoin on a common attribute
SELECT * FROM person NATURAL JOIN dependent

 * mysql://root:***@127.0.0.1
4 rows affected.

[(1, 'Bob', 4), (2, 'Anne', 1), (3, 'Dave', 1), (4, 'Carol', 2)]

In [33]:
%%sql
-- joining three tables
SELECT p1.*, dependent.*, provider.full_name as provider_name 
   FROM person as p1 JOIN dependent JOIN person as provider ON p1.person_id = dependent.person_id AND provider.person_id = dependent.provider_id

 * mysql://root:***@127.0.0.1
4 rows affected.

[(1, 'Bob', 1, 4, 'Carol'),
 (2, 'Anne', 2, 1, 'Bob'),
 (3, 'Dave', 3, 1, 'Bob'),
 (4, 'Carol', 4, 2, 'Anne')]